In [424]:
import numpy as np
import pandas as pd

In [425]:
titanic = pd.read_csv("titanic_train.csv", delimiter = ",")

In [426]:
titanic.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [427]:
df = titanic.copy()

In [428]:
del df["Name"]

In [429]:
del df["Ticket"]

In [430]:
del df["Cabin"]

In [431]:
df.head()

   Pclass     Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.0      1      0  26.000        S         1
1       3    male   NaN      0      0   8.050        S         0
2       2    male  39.0      0      0  26.000        S         0
3       3  female  29.0      0      4  21.075        S         0
4       3    male  25.0      0      0   7.050        S         0

In [432]:
df.isnull().sum()

Pclass        0
Sex           0
Age         132
SibSp         0
Parch         0
Fare          0
Embarked      1
Survived      0
dtype: int64

### Removing null entries and filling something in their place

In [433]:
titanic.Age.mean()

29.700559701492537

In [434]:
# filling survived peoples mean age in survived people's nan age
a = df.Survived ==1

In [435]:
df2 = df[a].copy(deep = True)

In [436]:
df2.Age.fillna(titanic[a].Age.mean(),inplace = True)

In [437]:
df2.head()

    Pclass     Sex        Age  SibSp  Parch   Fare Embarked  Survived
0        2  female  29.000000      1      0  26.00        S         1
6        1  female  35.000000      1      0  53.10        S         1
8        2    male  28.138158      0      0  13.00        S         1
10       3  female  23.000000      0      0   7.55        S         1
14       3  female  28.138158      0      0   7.75        Q         1

In [438]:
pd.options.mode.chained_assignment = None
df.Age[df.Survived==1] = df2.Age

In [439]:
# filling not survived peoples mean age in not survived people's nan age
b = df.Survived ==0
df3 = df[b].copy(deep =True)

In [440]:
df3.Age.fillna(titanic[b].Age.mean(), inplace = True)

In [441]:
df.Age[b] = df3.Age

In [442]:
df.head()

   Pclass     Sex        Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.000000      1      0  26.000        S         1
1       3    male  30.857143      0      0   8.050        S         0
2       2    male  39.000000      0      0  26.000        S         0
3       3  female  29.000000      0      4  21.075        S         0
4       3    male  25.000000      0      0   7.050        S         0

In [443]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    1
Survived    0
dtype: int64

In [444]:
#removing the row in which embarked is nan
df.drop(578,inplace = True)

In [445]:
df.isnull().sum()

Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
Survived    0
dtype: int64

In [446]:
df.head()

   Pclass     Sex        Age  SibSp  Parch    Fare Embarked  Survived
0       2  female  29.000000      1      0  26.000        S         1
1       3    male  30.857143      0      0   8.050        S         0
2       2    male  39.000000      0      0  26.000        S         0
3       3  female  29.000000      0      4  21.075        S         0
4       3    male  25.000000      0      0   7.050        S         0

In [447]:
def f1(s):
    if s == "S":
        return 0
    elif s == "C":
        return 1
    else :
        return 2

In [448]:
df.Embarked = df.Embarked.apply(f1)

In [449]:
def f2(s):
    if s == "female":
        return 0
    
    else :
        return 1

In [450]:
df.Sex = df.Sex.apply(f2)

In [451]:
df.reset_index(drop = True, inplace = True)

In [452]:
df.head()

   Pclass  Sex        Age  SibSp  Parch    Fare  Embarked  Survived
0       2    0  29.000000      1      0  26.000         0         1
1       3    1  30.857143      0      0   8.050         0         0
2       2    1  39.000000      0      0  26.000         0         0
3       3    0  29.000000      0      4  21.075         0         0
4       3    1  25.000000      0      0   7.050         0         0

### adding more columns

In [453]:
df2 = df.copy()

In [454]:
del df2["Survived"]

In [455]:
df2.head()

   Pclass  Sex        Age  SibSp  Parch    Fare  Embarked
0       2    0  29.000000      1      0  26.000         0
1       3    1  30.857143      0      0   8.050         0
2       2    1  39.000000      0      0  26.000         0
3       3    0  29.000000      0      4  21.075         0
4       3    1  25.000000      0      0   7.050         0

In [456]:
from sklearn.preprocessing import StandardScaler

In [457]:
col_names = ["Age","Fare"]
features = df[col_names]

In [458]:
scaler = StandardScaler()
scaler.fit(features.values)
features = scaler.transform(features.values)

In [459]:
df2[col_names] = features

In [460]:
df2.head()

   Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
0       2    0 -0.058756      1      0 -0.132339         0
1       3    1  0.086760      0      0 -0.528737         0
2       2    1  0.724792      0      0 -0.132339         0
3       3    0 -0.058756      0      4 -0.241100         0
4       3    1 -0.372175      0      0 -0.550821         0

In [461]:
df2.columns = [0,1,2,3,4,5,6]

In [462]:
df2.head()

   0  1         2  3  4         5  6
0  2  0 -0.058756  1  0 -0.132339  0
1  3  1  0.086760  0  0 -0.528737  0
2  2  1  0.724792  0  0 -0.132339  0
3  3  0 -0.058756  0  4 -0.241100  0
4  3  1 -0.372175  0  0 -0.550821  0

In [464]:
l = len(df2.columns)
for i in range(7):
    for j in range(i,7):
        df2[l] = df2[i]*df2[j]
        l += 1

In [466]:
df2.head()

,0,1,2,3,4,5,6,7,8,9,...,25,26,27,28,29,30,31,32,33,34
0,2,0,-0.058756,1,0,-0.132339,0,4,0,-0.117512,...,1,0,-0.132339,0,0,-0.000000,0,0.017514,-0.0,0
1,3,1,0.086760,0,0,-0.528737,0,9,3,0.260280,...,0,0,-0.000000,0,0,-0.000000,0,0.279563,-0.0,0
2,2,1,0.724792,0,0,-0.132339,0,4,2,1.449584,...,0,0,-0.000000,0,0,-0.000000,0,0.017514,-0.0,0
3,3,0,-0.058756,0,4,-0.241100,0,9,0,-0.176268,...,0,0,-0.000000,0,16,-0.964401,0,0.058129,-0.0,0
4,3,1,-0.372175,0,0,-0.550821,0,9,3,-1.116526,...,0,0,-0.000000,0,0,-0.000000,0,0.303404,-0.0,0

In [531]:
X  = df2.values
Y = df.values[:,-1]

In [532]:
X.shape
Y.shape

(667,)

In [533]:
X.shape

(667, 35)

In [534]:
from sklearn.linear_model import LogisticRegression

In [535]:
clf1 = LogisticRegression(C = 2 )

In [536]:
clf1.fit(X,Y)

c:\users\maverick\anacondanew\lib\site-packages\sklearn\linear_model\logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=2, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=0.0001, verbose=0,
                   warm_start=False)

In [537]:
clf1.score(X,Y)

0.8245877061469266

In [538]:
clf1.predict_proba(X)[4]

array([0.87483293, 0.12516707])

## testing data

In [539]:
titanic_test = pd.read_csv("titanic_test.csv",delimiter = ",")

In [540]:
titanic_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [541]:
df_test = titanic_test.copy()

In [542]:
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

## cleaning of testing data

In [543]:
del df_test["Name"]
del df_test["Cabin"]
del df_test["Ticket"]

In [544]:
df_test.isnull().sum()

Pclass       0
Sex          0
Age         45
SibSp        0
Parch        0
Fare         0
Embarked     1
dtype: int64

In [545]:
df_test.Age.fillna(titanic_test.Age.mean(),inplace = True)

In [546]:
df_test[df_test.Embarked.isnull()]

     Pclass     Sex   Age  SibSp  Parch  Fare Embarked
208       1  female  62.0      0      0  80.0      NaN

In [547]:
def f2(s):
    if s == "female":
        return 0
    
    else :
        return 1
df_test.Sex = df_test.Sex.apply(f2)

In [548]:
df_test.Embarked.value_counts()

S    160
C     35
Q     27
Name: Embarked, dtype: int64

In [549]:
## as S is max we will replace nan by S
df_test.iloc[208,4]

0

In [550]:
df_test.iloc[208,6] = "S"

In [552]:
df_test.iloc[205:210,:]

     Pclass  Sex        Age  SibSp  Parch     Fare Embarked
205       3    1  29.694775      1      0  19.9667        S
206       3    1  32.000000      0      0  56.4958        S
207       3    1  26.000000      0      0   7.8958        S
208       1    0  62.000000      0      0  80.0000        S
209       3    0   9.000000      3      2  27.9000        S

In [553]:
def f1(s):
    if s == "S":
        return 0
    elif s == "C":
        return 1
    else :
        return 2
df_test.Embarked = df_test.Embarked.apply(f1)

In [554]:
df_test.head()

   Pclass  Sex        Age  SibSp  Parch     Fare  Embarked
0       2    1   8.000000      1      1  36.7500         0
1       1    0  49.000000      0      0  25.9292         0
2       3    1  29.694775      0      0   7.7375         2
3       2    0  24.000000      2      1  27.0000         0
4       1    1  36.000000      0      0  26.2875         0

In [555]:
col_names = ["Age","Fare"]
features_test = df_test[col_names]

In [556]:

features_test = scaler.transform(features_test.values)

In [557]:
df_test[col_names] = features_test

In [558]:
df_test.head()

   Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
0       2    1 -1.704207      1      1  0.105058         0
1       1    0  1.508340      0      0 -0.133903         0
2       3    1 -0.004317      0      0 -0.535638         2
3       2    0 -0.450530      2      1 -0.110256         0
4       1    1  0.489728      0      0 -0.125990         0

### more columns in testing data

In [559]:
df2_test = df_test.copy()

In [560]:
df2_test.columns = [0,1,2,3,4,5,6]

In [561]:
df2_test.head()

   0  1         2  3  4         5  6
0  2  1 -1.704207  1  1  0.105058  0
1  1  0  1.508340  0  0 -0.133903  0
2  3  1 -0.004317  0  0 -0.535638  2
3  2  0 -0.450530  2  1 -0.110256  0
4  1  1  0.489728  0  0 -0.125990  0

In [562]:
l1 = len(df2_test.columns)
for i in range(7):
    for j in range(i,7):
        df2_test[l1] = df2_test[i]*df2_test[j]
        l1 += 1

In [563]:
df2_test.shape

(223, 35)

In [564]:
X_test = df2_test.values

In [565]:
X_test

array([[ 2.        ,  1.        , -1.70420669, ...,  0.01103718,
         0.        ,  0.        ],
       [ 1.        ,  0.        ,  1.50833981, ...,  0.01792994,
        -0.        ,  0.        ],
       [ 3.        ,  1.        , -0.00431707, ...,  0.28690853,
        -1.07127687,  4.        ],
       ...,
       [ 1.        ,  0.        , -0.99901356, ...,  2.8844938 ,
         1.69837976,  1.        ],
       [ 3.        ,  1.        ,  1.03821105, ...,  0.31817597,
        -0.        ,  0.        ],
       [ 2.        ,  1.        ,  0.5289049 , ...,  0.01751367,
        -0.        ,  0.        ]])

In [566]:
Y_pred_test = clf1.predict(X_test)

In [567]:
Y_pred_test.shape

(223,)

In [568]:
clf1.score(X_test,Y_pred_test)

1.0

In [569]:
np.savetxt("titanic_predict2_more_columns.csv",Y_pred_test,delimiter =",")